export type tGroup = {
      "id": number, 
      "Группа": string | number, 
      "Минимальная цена": number , 
      "Максимальная цена": number , 
      "Средняя цена": number,
  }[];

export const  countries: tGroup = [
    { "id": 1, "Группа": "Electra" , "Минимальная цена": 269.99 , "Максимальная цена": 2999.99 , "Средняя цена": 761.01 },
    { "id": 2, "Группа": "Haro" , "Минимальная цена": 209.99 , "Максимальная цена": 1469.99 , "Средняя цена": 621.99 },
    { "id": 3, "Группа": "Heller" , "Минимальная цена": 1320.99 , "Максимальная цена": 2599.00 , "Средняя цена": 2173.00 },
    { "id": 4, "Группа": "Pure Cycles" , "Минимальная цена": 429.00 , "Максимальная цена": 449.00 , "Средняя цена": 442.33 },
    { "id": 5, "Группа": "Ritchey" , "Минимальная цена": 749.99 , "Максимальная цена": 749.99 , "Средняя цена": 749.99 },
    { "id": 6, "Группа": "Strider" , "Минимальная цена": 89.99 , "Максимальная цена": 289.99 , "Средняя цена": 209.99 },
    { "id": 7, "Группа": "Sun Bicycles" , "Минимальная цена": 109.99 , "Максимальная цена": 1559.99 , "Средняя цена": 524.47 },
    { "id": 8, "Группа": "Surly" , "Минимальная цена": 469.99 , "Максимальная цена": 2499.99 , "Средняя цена": 1331.75 },
    { "id": 9, "Группа": "Trek" , "Минимальная цена": 149.99 , "Максимальная цена": 11999.99 , "Средняя цена": 2500.06 },
];


    export const years: tGroup = [
        { "id": 1 , "Группа": 2016 , "Максимальная цена": 3999.99 , "Минимальная цена": 269.99 , "Средняя цена": 980.30 },
        { "id": 2 , "Группа": 2017 , "Максимальная цена": 6499.99 , "Минимальная цена": 109.99 , "Средняя цена": 1279.93 },
        { "id": 3 , "Группа": 2018 , "Максимальная цена": 11999.99 , "Минимальная цена": 89.99 , "Средняя цена": 1658.47 },
        { "id": 4 , "Группа": 2019 , "Максимальная цена": 3799.99 , "Минимальная цена": 1699.99 , "Средняя цена": 2583.32 },
    ];    

    export const types: tGroup = [
        { "id": 1 , "Группа": "Children Bicycles" , "Максимальная цена": 489.99 , "Минимальная цена": 89.99 , "Средняя цена": 287.79 },
        { "id": 2 , "Группа": "Comfort Bicycles" , "Максимальная цена": 2599.99 , "Минимальная цена": 416.99 , "Средняя цена": 682.12 },
        { "id": 3 , "Группа": "Cruisers Bicycles" , "Максимальная цена": 2999.99 , "Минимальная цена": 250.99 , "Средняя цена": 730.41 },
        { "id": 4 , "Группа": "Cyclocross Bicycles" , "Максимальная цена": 3999.99 , "Минимальная цена": 1549.00 , "Средняя цена": 2542.79 },
        { "id": 5 , "Группа": "Electric Bikes" , "Максимальная цена": 4999.99 , "Минимальная цена": 1559.99 , "Средняя цена": 3281.66 },
        { "id": 6 , "Группа": "Mountain Bikes" , "Максимальная цена": 5299.99 , "Минимальная цена": 379.99 , "Средняя цена": 1649.76 },
        { "id": 7 , "Группа": "Road Bikes" , "Максимальная цена": 11999.99 , "Минимальная цена": 749.99 , "Средняя цена": 3175.36 },        
    ]; 
